import { PageData } from '../models/page-data';  // adjust the path as needed
import { industryConsulting, medicalRights, workAbility } from './cards.data';

export const causalLinkPage: PageData = {
  h1: 'קביעת קשר סיבתי',
  sections: [
    {
      type: 'large-card',
      h2: 'קביעת קשר סיבתי',
      content: [
        {
          type: 'p',
          content:
            'קביעת קשר סיבתי בין מצב שנגרם או שהוחמר כתוצאה מחשיפה לגורם סיכון בעבודתו של אדם היא אמנות שנסמכת על הבנת העיסוק, הבנת סוגי החשיפות והסיכונים המקצועיים והיכולת לקשור בינהם על בסיס נתונים סטטיסטיים וידע אפידמיולוגי וספרות רפואית.\n' +
            'קביעת קשר סיבתי בין מצב רפואי לבין גורם סיכון במקום העבודה יכול לאפשר לאדם לקבל הכרה בגורם למצבו הרפואי ולאפשר לו ולמשפחתו למצות את זכויותיו הרפואי'
        },
        {
          type: 'image',
          url: '/assets/images/placeholder.jpg'
        }
      ]
    },
    {
      type: 'cards-container',
      cards: [workAbility, industryConsulting, medicalRights]
    }
  ]
};

export const industryConsultingPage: PageData = {
  h1: 'ייעוץ לגופים גדולים',
  sections: [
    {
      type: 'large-card',
      h2: 'ייעוץ לגופים גדולים',
      content: [
        {
          type: 'p',
          content:
            'חברת ברק מדיקל עוסקת ועסקה בייעוץ כושר עבודה לגופים גדולים בהם רשות הכבאות וההצלה, שירות בתי הסוהר וגופים תעשייתיים. השירותים הניתנים לגופים אלה הם בתחום של קביעת כושר העבודה והיכולת של עובד לעבוד בעיסוקו עם וללא מגבלות.'
        },
        {
          type: 'image',
          url: '/assets/images/placeholder.jpg'
        }
      ]
    },
    {
      type: 'cards-container',
      cards: [workAbility, industryConsulting, medicalRights]
    }
  ]
};

export const divingMedicinePage: PageData = {
  h1: 'רפואת צלילה',
  sections: [
    {
      type: 'large-card',
      h2: 'רפואת צלילה',
      content: [
        {
          type: 'p',
          content:
            'צלילה ספורטיבית הנה ספורט בטוח ומהנה, המתאים לגילאים צעירים ומבוגרים כאחת. עם זאת, צלילה מתבצעת, מטבעה, בסביבה שהינה זרה לאדם ולכן נחשבת לספורט בסיכון מוגבר.\n' +
            'כדי לצלול בבטחה, פותחו לאורך השנים ציוד ונהלים מדויקים ומפורטים, אשר הביאו אותנו למצב הבטיחות הגבוה השורר היום בישראל.\n' +
            'שאלת הערכת כושרו הגופני, המנטלי והנפשי של הצולל להתמודד עם המים הנה מורכבת יותר.\n' +
            'בעולם קיימות גישות שונות למיון רפואי לצלילה בכלל ולכל מצב רפואי ספציפי בפרט. התורה הישראלית החלה להתפתח בסוף שנות השבעים של המאה הקודמת ומאז מתעדכנת ומיושמת באופן רציף.\n' +
            'הגישה העקרונית של המיון הרפואי של צוללים הינה לאפשר לכל אחד ואחת היכולים לצלול בבטחה לעשות זאת.\n' +
            'המטרות המוצהרות של הקריטריונים הן:\n' +
            'לאפשר לאדם שמבקש לצלול צלילה ספורטיבית לעשות כך, תוך שמירה מקסימלית על בריאותם וביטחונם של הצולל ואלה שעמו במים ומחוץ למים.\n' +
            'לזהות את מי שעלולים לסכן את עצמם או אחרים בצלילה.\n' +
            'לזהות את מי שזקוקים לסיוע מיוחד בצלילה, להגבלות כגון עומק וסוג הצלילה, לסיוע מיוחד או להדרכה ספציפית כדי לצלול בבטחה.\n' +
            'ההסתדרות הרפואית בישראל (הר"י) אישרה הכרה ברופאי צלילה כתחום ידע מיוחד, הכפוף לקריטריונים שקבעה המועצה המדעית של הר"י בשנת 2012 ולאישור פרטני של החברה הישראלית לרפואת צלילה ורפואה היפרבארית.\n' +
            'על פי ההגדרות המחייבות במדינת ישראל "רופא צלילה" או "רופא בודק צוללים" הינו רופא שהינו בעל תעודת צולל מכל סוג ובוגר קורס רפואת צלילה במכון לרפואה ימית של חיל הים או קורס מקביל אחר.\n\n' +
            'ד"ר יאיר ברק הוסמך כרופא צלילה בשנת 2006. לד"ר ברק משלב ניסיון בעולם הצלילה גם מהפן הרפואי וגם מהפן המעשי כמדריך צלילה.\n' +
            'ד"ר ברק הינו חבר בהתאחדות הישראלית לצלילה מגיל 15 והוסמך כמדריך כבר בשנת 1997 ומחזיק ברישיונות הדרכה לדרגות מתקדמות לרבות כמדריך בקורסי מדריכים.\n' +
            'ד"ר ברק משמש כמדריך צלילה מיטיבה לצוללים בעלי צרכים מיוחדים.\n' +
            'ד"ר ברק משמש כמדיך מטעם ההתאחדות הישראלית לצלילה למדריכי צלילה בנושאי החייאה והצלה מטביעה.\n\n' +
            'קישורים:\nאתר רשות הצלילה רפואה?\nאתר ההתאחדות הישראלית לצלילה ?'
        },
        {
          type: 'image',
          url: '/assets/images/placeholder.jpg'
        }
      ]
    },
    {
      type: 'cards-container',
      cards: [workAbility, industryConsulting, medicalRights]
    }
  ]
};

export const medicalAdministrationPage: PageData = {
  h1: 'מנהל רפואי',
  sections: [
    {
      type: 'large-card',
      h2: 'מה זה מנהל רפואי',
      content: [
        {
          type: 'p',
          content:
            'מנהל רפואי הינה התמחות מוכרת ורשמית בתחום הרפואה במדינת ישראל.\n' +
            'על פי הגדרות ההתמחות מטעם ההסתדרות הרפואית לישראל המנהל הרפואי הוא המנהיג והמוביל של ארגון רפואי ונדרש לביצוע תפקידו תוך שימוש מושכל במשאבים של משאבי אנוש, ידע, הון, נכסים חומריים ונכסים לא-מוחשיים, זאת על מנת להשיג את מטרות הארגון, ולהבטיח טיפול רפואי איכותי.\n' +
            'המנהל הרפואי נדרש לעסוק ולהפגין מיומנות בפעולות תכנון, ארגון, הנהגה ובקרה.\n' +
            'כחלק מהגדרות העיסוק והמקצוע הרופא המומחה במנהל ציבורי נדרש להפגין וליישם היכרות מעמיקה עם מבנה והתפתחות מערכת הבריאות בישראל לרבות המבנה הארגוני וכן עם חקיקה ונהלים במערכת הבריאות.\n' +
            'לעיתים רבות ההתנהלות של המערכת הרפואית מול הפרט נובעת מאילוצים מבניים או רגולטוריים, לפיכך התייעצות עם רופא מומחה במנהל רפואי יכולה להביא ערך מוסף בהתנהלות הנכונה למול המערכת הרפואית אף מעבר להתנהלות מול הרופאים המטפלים.\n' +
            'דוגמאות אפשריות לנושאים המערבים סוגיות רגולטוריות בנוסף לסוגיות רפואיות טהורות קיימות בעיקר בהתנהלות מול משרדי ממשלה וגופים כגון מכון רפואי לבטיחות בדרכים (מרב"ד), רישוי כלי ירייה, וועדות רפואיות שונות וכו\'\n' +
            'ד"ר יאיר ברק הינו רופא מומחה למנהל רפואי אשר ביצע את התמחותו במסגרת מפקדת קצין הרפואה הראשי בצה"ל וההנהלה הכללית של משרד הבריאות.\n' +
            'לד"ר ברק ניסיון ניהולי רב שנים כמנהל מרפאה מחוזית לרפואה תעסוקתית, כמנהל מחלקה לנהלים וסטנדרטים בקהילה בהנהלת משרד הבריאות ובתפקידים בכירים בחיל הרפואה כגון מפקד הרפואה בפיקוד הדרום, ראש ענף מיון רפואי ורפואה תעסוקתית וכו\'.'
        },
        {
          type: 'image',
          url: '/assets/images/placeholder.jpg'
        }
      ]
    },
    {
      type: 'cards-container',
      cards: [workAbility, industryConsulting, medicalRights]
    }
  ]
};

export const workAbilityPage: PageData = {
  h1: 'כושר עבודה',
  sections: [
    {
      type: 'large-card',
      h2: 'כושר עבודה',
      content: [
        {
          type: 'p',
          content:
            'רפואה צבאית אינה נחשבת תחום התמחות מוכר במדינת ישראל ואולם לאור החלקים המשמעותיים שתופס השירות הצבאי בחיי תושבי מדינת ישראל ניתן לראותו הלכה למעשה כתחום ידע ייחודי ומובחן.\n' +
            'הממשקים הנוגעים למטופל מול גורמי הרפואה בצה"ל מתחילים כבר בשלב המועמדות לשירות ביטחון והוועדות הרפואיות לקביעת הפרופיל הצבאי המשפיע על אופק השירות.\n' +
            'מעבר לסוגיות הפרופיל וסעיפי הליקוי נ'
        },
        {
          type: 'image',
          url: '/assets/images/placeholder.jpg'
        }
      ]
    },
    {
      type: 'cards-container',
      cards: [workAbility, industryConsulting, medicalRights]
    }
  ]
};

export const militaryMedicinePage: PageData = {
  h1: 'רפואה צבאית',
  sections: [
    {
      type: 'large-card',
      h2: 'מה זה רפואה צבאית',
      content: [
        {
          type: 'p',
          content:
            'רפואה צבאית אינה נחשבת תחום התמחות מוכר במדינת ישראל ואולם לאור החלקים המשמעותיים שתופס השירות הצבאי בחיי תושבי מדינת ישראל ניתן לראותו הלכה למעשה כתחום ידע ייחודי ומובחן.\n' +
            'הממשקים הנוגעים למטופל מול גורמי הרפואה בצה"ל מתחילים כבר בשלב המועמדות לשירות ביטחון והוועדות הרפואיות לקביעת הפרופיל הצבאי המשפיע על אופק השירות.\n' +
            'מעבר לסוגיות הפרופיל וסעיפי הליקוי נ'
        },
        {
          type: 'image',
          url: '/assets/images/placeholder.jpg'
        }
      ]
    },
    {
      type: 'cards-container',
      cards: [workAbility, industryConsulting, medicalRights]
    }
  ]
};

export const aviationMedicinePage: PageData = {
  h1: 'רפואה תעופתית',
  sections: [
    {
      type: 'large-card',
      h2: 'מה זה רפואה תעופתית',
      content: [
        {
          type: 'p',
          content:
            'רף הבטיחות הגבוה הנהוג בתחום התעופה מחייב ביצוע מעקב מתמיד אחר בריאותם של טייסים, פקחי טיסה ומפעילי כטב"מ. לכן עליהם לעבור בדיקות רפואיות תקופתיות על מנת לוודא את כשירותם הרפואית. תעודה רפואית תקפה מאשרת את ההתאמה הבריאותית בהתאם לרישיון או להגדר המבוקש.\n\n' +
            'שלבי התהליך הינם:\n\n' +
            '    תשלום אגרה עבור הנפקת תעודה רפואית לרשות התעופה האזרחית.\n' +
            '    בדיקות מקדימות לבעיות רפואיות ידועות טרם הגעה לרופא תעופתי מוסמך על ידי רת"א.\n' +
            '    מילוי טופס בקשה לבדיקה רפואית בצורה מקוונת און-ליין.\n' +
            '    ביצוע בדיקה רפואית אצל רופא תעופתי מוסמך על ידי רת"א.\n' +
            '    קבלת התעודה.\n\n' +
            'יש לבדוק עם הרופא התעופתי שבחרתם אלו בדיקות יש לבצע לפני הגעה לבקשה הרפואית לפי סוג התעודה הרפואית המבוקשת, גיל והיסטוריה רפואית.\n\n' +
            'עליכם לבצע בדיקה אצל רופא תעופתי אשר הוסמך לכך על ידי מנהל רשות התעופה האזרחית. לתשומת ליבכם ביצוע הבדיקה כרוך בתשלום לרופא, בנוסף לתשלום האגרה לבדיקה רפואית עבור רת"א טרם הגעתכם לבדיקה, עליכם למלא טופס בקשה מקוון אשר ישלח לרופא המוסמך שתבחרו באמצעות דוא"ל בסיום התהליך. כדי לקבל שירות ממשלתי מזוהה תידרשו לעבור תהליך חד פעמי של הרשמה ואימות זהות. לידיעתכם - טופס הבקשה הדיגיטלי נשמר באזור האישי של המבקש ובמידת הצורך ניתן לערוך אותו.'
        },
        {
          type: 'image',
          url: '/assets/images/placeholder.jpg'
        }
      ]
    },
    {
      type: 'cards-container',
      cards: [workAbility, industryConsulting, medicalRights]
    }
  ]
};


export const medicalRightsPage: PageData = {
  h1: 'מיצוי זכויות',
  sections: [
    {
      type: 'large-card',
      h2: 'מה זה רפואה תעופתית',
      content: [
        {
          type: 'p',
          content:
            'רף הבטיחות הגבוה הנהוג בתחום התעופה מחייב ביצוע מעקב מתמיד אחר בריאותם של טייסים, פקחי טיסה ומפעילי כטב"מ. לכן עליהם לעבור בדיקות רפואיות תקופתיות על מנת לוודא את כשירותם הרפואית. תעודה רפואית תקפה מאשרת את ההתאמה הבריאותית בהתאם לרישיון או להגדר המבוקש.\n\n' +
            'שלבי התהליך הינם:\n\n' +
            '    תשלום אגרה עבור הנפקת תעודה רפואית לרשות התעופה האזרחית.\n' +
            '    בדיקות מקדימות לבעיות רפואיות ידועות טרם הגעה לרופא תעופתי מוסמך על ידי רת"א.\n' +
            '    מילוי טופס בקשה לבדיקה רפואית בצורה מקוונת און-ליין.\n' +
            '    ביצוע בדיקה רפואית אצל רופא תעופתי מוסמך על ידי רת"א.\n' +
            '    קבלת התעודה.\n\n' +
            'יש לבדוק עם הרופא התעופתי שבחרתם אלו בדיקות יש לבצע לפני הגעה לבקשה הרפואית לפי סוג התעודה הרפואית המבוקשת, גיל והיסטוריה רפואית.\n\n' +
            'עליכם לבצע בדיקה אצל רופא תעופתי אשר הוסמך לכך על ידי מנהל רשות התעופה האזרחית. לתשומת ליבכם ביצוע הבדיקה כרוך בתשלום לרופא, בנוסף לתשלום האגרה לבדיקה רפואית עבור רת"א טרם הגעתכם לבדיקה, עליכם למלא טופס בקשה מקוון אשר ישלח לרופא המוסמך שתבחרו באמצעות דוא"ל בסיום התהליך. כדי לקבל שירות ממשלתי מזוהה תידרשו לעבור תהליך חד פעמי של הרשמה ואימות זהות. לידיעתכם - טופס הבקשה הדיגיטלי נשמר באזור האישי של המבקש ובמידת הצורך ניתן לערוך אותו.'
        },
        {
          type: 'image',
          url: '/assets/images/placeholder.jpg'
        }
      ]
    },
    {
      type: 'cards-container',
      cards: [workAbility, industryConsulting, medicalRights]
    }
  ]
};

export const pageDataMap: Record<string, PageData> = {
  'work-ability': workAbilityPage,
  'industry-consulting': industryConsultingPage,
  'causal-link-assessment': causalLinkPage,
  'medical-rights': medicalRightsPage,
  'military-medicine': militaryMedicinePage,
  'medical-administration': medicalAdministrationPage,
  'diving-medicine': divingMedicinePage,
  'aviation-medicine': aviationMedicinePage
};